Parsley.addMessages('sr', {
    defaultMessage: "Ово поље је неисправно.",
    type: {
      email: "Ово поље мора да буде исправна email адреса.",
      url: "Ово поље мора да буде исправан URL.",
      number: "Ово поље мора да буде број.",
      integer: "Ово поље мора да буде цео број.",
      digits: "Ово поље мора да садржи само цифре.",
      alphanum: "Ово поље мора да садржи само слова и бројеве."
    },
    notblank: "Ово поље не сме да буде празно.",
    required: "Ово поље је обавезно.",
    pattern: "Ово поље је неисправно.",
    min: "Ово поље мора да буде веће или једнако %s.",
    max: "Ово поље мора да буде мање или једнако %s.",
    range: "Ово поље мора да буде између %s i %s.",
    minlength: "Ово поље мора да има %s или више карактера.",
    maxlength: "Ово поље мора да има %s или мање карактера.",
    length: "Ово поље мора да буде дужине %s и %s карактера.",
    mincheck: "Морате одабрати најмање %s ставки.",
    maxcheck: "Можете одабрати највише %s ставки.",
    check: "Морате одабрати између %s и %s ставки.",
    equalto: "Ово поље мора да буде исто."
  });

  Parsley.setLocale('sr');